{
    "Header": {
        "portfolio": "Portfolio",
        "home": "Home",
        "about": "About",
        "skills": "Skills",
        "projects": "Projects",
        "contact": "Contact"
    },
    "HomePage": {
        "frontend": "Frontend developer",
        "yearsExperience": "4 Years of Experience",
        "description": "Passionate about creating engaging user interfaces and transform ideas into responsive, high-performance websites.",
        "contact": "Contact"
    },
    "AboutPage": {
        "title": "About me",
        "description": "With 4 years of expertise in frontend development and UI/UX design, I specialize in building seamless user experiences. Proficient in Angular, I develop dynamic interfaces, integrate microservices, and implement secure authentication. I've developed custom WordPress plugins using PHP and JavaScript, and built scalable RESTful APIs with NestJs and TypeOrm. Experienced in Git for version control on GitHub and GitLab, I excel in Scrum environments, demonstrating leadership, teamwork, and project management skills.",
        "contact": "Contact"
    },
    "Timeline": {
        "data1": {
            "title": "Freelancer",
            "time": "2024 - present",
            "description": "I develop custom user interface solutions for various companies. A footwear client increased their sales by 15% after launching their SEO-optimized WordPress site. I also handle updates and improvements on previous projects, focusing on interface aesthetics and functionality."
        },
        "data2": {
            "title": "Hexa Solutions S.A.S.",
            "time": "2022 - 2024",
            "description": "I led the development of a WordPress portal, creating custom plugins and optimizing SEO to rank for key terms like 'digital credit'. I redesigned an Angular-based payment gateway, reducing abandonment rates from 35% to 20%, and collaborated on web applications using Angular and NestJs."
        },
        "data3": {
            "title": "Hyperlink S.A.S",
            "time": "2021 - 2022",
            "description": "I designed a reusable template base in Bootstrap for headers, forms, and sidebars, customizable to client requirements, enabling the creation of adaptable portals with optimized load times."
        },
        "data4": {
            "title": "Roojotech S.A.S",
            "time": "2021",
            "description": "I developed an administrative platform using Microsoft Power Platform, improving the management of information previously handled in Excel, which increased the company’s operational efficiency."
        }
    },
    "SkillsPage": {
        "title": "Skills",
        "subtitle": "Stack technologies",
        "utilities": "Utilities"
    },
    "ProjectsPage": {
        "title": "Projects",
        "projects": {
            "projects": {
                "front_1": "Platform for UIS students with authentication and role management. Efficiently organizes psychological appointments. Developed in Angular with a focus on security and usability.",
                "front_2": "App to search for movies, providing details like cast, characters, summaries, and trailers. Enhances user experience with quick access to relevant information.",
                "front_3": "React app for searching and displaying GIFs, featuring advanced search options. Designed for fast and smooth image rendering. Fully optimized for user experience.",
                "front_4": "Mobile app that consumes services to generate routes and track real-time positioning. Ideal for route tracking, enhancing efficiency in time and resource management.",
                "front_5": "Source code for my personal portfolio, with detailed project documentation. Includes all steps and technologies used, showcasing my technical expertise.",
                "front_6": "Base template for React projects, featuring pre-configured routing, validations, and authentication. Perfect for quickly starting scalable projects with a solid architecture.",
                "front_7": "Mobile app that simulates loans, generates amortization tables, schedules notifications, and converts interest rates. A comprehensive tool for managing loans and financial simulations.",
                "back_1": "Backend in NestJs with TypeScript, JWT, authentication, password encryption, TypeOrm integration, and MySQL database. Perfect for starting projects with a robust and secure architecture.",
                "back_2": "Backend developed in NestJs with CRUD for products, authentication, TypeOrm integration, and WebSocket. A complete solution for store management with real-time updates.",
                "back_3": "Backend for a psychological appointment platform, built in NestJs with authentication, MongoDB, and TypeOrm. Efficient user management and secure database communication.",
                "back_4": "Backend built in Express and TypeScript, using MongoDB and JWT for an admin panel. Provides secure authentication and efficient data management for control panel projects."
            }
        },
        "inst_prev": "View previous project",
        "inst_play": "Detener proyecto",
        "inst_next": "View next project",
        "repeat": "Repeat",
        "prev": "Prev project",
        "seeProject": "See project",
        "next": "Next project",
        "random": "Random project",
        "play_pause": "Play / Pause"
    },
    "CertificationsPage": {
        "title": "Certifications",
        "subtitle": "Press to expand",
        "more_certifications": "More certifications",
        "course": "Name",
        "date": "Date",
        "data1": {
            "platform": "Udemy",
            "course": "Advanced Angular",
            "date": "2024"
        },
        "data2": {
            "platform": "Udemy",
            "course": "React Native: Native applications for IOS and Android",
            "date": "2024"
        },
        "data3": {
            "platform": "Udemy",
            "course": "React: From zero to expert (Hooks and MERN)",
            "date": "2024"
        },
        "data4": {
            "platform": "Udemy",
            "course": "Nest: Scalable backend development with Node",
            "date": "2024"
        },
        "data5": {
            "platform": "Udemy",
            "course": "Databases with MySQL + ChatGPT and MongoDB",
            "date": "2024"
        }
    }
}