{
    "Header": {
        "portfolio": "Portafolio",
        "home": "Inicio",
        "about": "Sobre",
        "skills": "Habilidades",
        "projects": "Proyectos",
        "contact": "Contacto"
    },
    "HomePage": {
        "frontend": "Desarrollador Fullstack",
        "yearsExperience": "{years} años de experiencia",
        "description": "Experto en interfaces de usuario y diseño responsivo de alto rendimiento, transformando ideas en experiencias digitales atractivas.",
        "contact": "Contacto"
    },
    "AboutPage": {
        "title": "Sobre mí",
        "description": "Desarrollador especializado en frontend y diseño UI/UX, con un enfoque en la creación de experiencias de usuario fluidas y atractivas. Domino Angular y React para el desarrollo de interfaces dinámicas, integraciones con microservicios y autenticación segura. También tengo experiencia en el desarrollo de plugins personalizados en WordPress usando PHP y JavaScript. En el backend, he construido APIs RESTful escalables utilizando NestJs y Express. Mis habilidades en control de versiones con Git (GitHub y GitLab) y mi participación en entornos Scrum me han permitido destacar en proyectos colaborativos, donde aporto tanto liderazgo como una fuerte capacidad de gestión.",
        "contact": "Contacto"
    },
    "Timeline": {
        "data1": {
            "title": "Freelancer",
            "time": "2024 - presente",
            "description": "Desarrollo soluciones personalizadas de interfaz de usuario para diversas empresas. Un cliente del sector calzado aumentó sus ventas en un 15% tras el lanzamiento de su sitio WordPress optimizado para SEO. También realizo actualizaciones y mejoras en proyectos previos, enfocándome en la estética y funcionalidad de las interfaces."
        },
        "data2": {
            "title": "Hexa Solutions S.A.S.",
            "time": "2022 - 2024",
            "description": "Lideré el desarrollo de un portal en WordPress, creando plugins personalizados y optimizando el SEO para posicionar el sitio en palabras clave como 'crédito digita'. Reestructuré una pasarela de pagos en Angular, reduciendo la deserción de pagos del 35% al 20%, y colaboré en el desarrollo de aplicaciones web con Angular y NestJs."
        },
        "data3": {
            "title": "Hyperlink S.A.S",
            "time": "2021 - 2022",
            "description": "Diseñé una base de plantillas reutilizables en Bootstrap para headers, formularios y sidebars, personalizables según los requerimientos del cliente, lo que permitió crear portales adaptables con tiempos de carga optimizados."
        },
        "data4": {
            "title": "Roojotech S.A.S",
            "time": "2021",
            "description": "Desarrollé una plataforma administrativa usando Microsoft Power Platform, mejorando la gestión de información previamente manejada en Excel, lo que incrementó la eficiencia operativa de la empresa."
        }
    },
    "SkillsPage": {
        "title": "Destrezas",
        "subtitle": "Tecnologías del stack",
        "utilities": "Utilidades"
    },
    "ProjectsPage": {
        "title": "Proyectos",
        "see_code": "Ver código del proyecto:",
        "see_code_description": "Haz clic en el nombre del proyecto para acceder al repositorio.",
        "projects": {
            "front_1": "Plataforma para estudiantes de la UIS, con autenticación y gestión de roles. Permite organizar citas psicológicas de manera eficiente. Desarrollada en Angular con enfoque en seguridad y usabilidad.",
            "front_2": "Aplicación para buscar películas con detalles como reparto, personajes, resúmenes y trailers. Facilita el acceso rápido a información relevante. Desarrollada para optimizar la experiencia del usuario.",
            "front_3": "Aplicación en React para buscar y mostrar GIFs, con opciones de búsqueda avanzada. El proyecto está diseñado para ofrecer un despliegue ágil y fluido de imágenes animadas. Totalmente optimizado para UX.",
            "front_4": "Aplicación móvil que consume servicios para generar rutas y trazar posicionamientos en tiempo real. Ideal para seguimiento y trazabilidad de recorridos, optimizando la eficiencia en tiempo y recursos.",
            "front_5": "Código fuente de mi portafolio personal, con documentación detallada del desarrollo. Incluye todos los pasos y tecnologías utilizadas para crear el proyecto, mostrando mi experiencia técnica.",
            "front_6": "Plantilla base para proyectos en React con rutas, validaciones y autenticación preconfiguradas. Ideal para iniciar proyectos rápidamente, con una arquitectura sólida y escalable.",
            "front_7": "App móvil que permite simular créditos, generar tablas de amortización, agendar notificaciones y convertir tasas de interés. Herramienta integral para la gestión de préstamos y simulaciones financieras.",
            "back_1": "Backend en NestJs con TypeScript, JWT, autenticación, encriptación de contraseñas, integración con TypeOrm y base de datos MySQL. Ideal para iniciar proyectos con una arquitectura robusta y segura.",
            "back_2": "Backend desarrollado en NestJs con CRUD para productos, autenticación, integración de TypeOrm, y WebSocket. Proporciona una solución completa para la gestión de tiendas con actualización en tiempo real.",
            "back_3": "Backend para plataforma de citas psicológicas, desarrollado en NestJs con autenticación, MongoDB, y TypeOrm. Ofrece gestión eficiente de usuarios y seguridad en la comunicación con bases de datos.",
            "back_4": "Backend hecho en Express y TypeScript, con MongoDB y JWT para un panel administrativo. Proporciona autenticación segura y gestión eficiente de datos para proyectos con panel de control."
        },
        "inst_prev": "Ver proyecto anterior",
        "inst_play": "Detener proyecto",
        "inst_next": "Ver siguiente proyecto",
        "repeat": "Repetir",
        "prev": "Proyecto anterior",
        "seeProject": "Ver proyecto",
        "next": "Siguiente proyecto",
        "random": "Aleatorio",
        "play_pause": "Play / Pause"
    },
    "CertificationsPage": {
        "title": "Certificaciones",
        "subtitle": "Presiona para expandir",
        "more_certifications": "Más certificaciones",
        "course": "Nombre",
        "date": "Fecha",
        "data1": {
            "platform": "Udemy",
            "course": "Advanced Angular",
            "date": "2024"
        },
        "data2": {
            "platform": "Udemy",
            "course": "React Native: Aplicaciones nativas para IOS and Android",
            "date": "2024"
        },
        "data3": {
            "platform": "Udemy",
            "course": "React: De cero a experto (Hooks y MERN)",
            "date": "2024"
        },
        "data4": {
            "platform": "Udemy",
            "course": "Nest: Desarrollo escalable de backend con Node",
            "date": "2024"
        },
        "data5": {
            "platform": "Udemy",
            "course": "Bases de datos MySQL + ChatGPT y MongoDB",
            "date": "2024"
        }
    }
}